app/views/people/show.html.erb

SELECT "schools".* FROM "schools" WHERE "schools"."person_id" = $1  [["person_id", 2]]
---
<ul>
  <% @person.schools.each do |school| %>

SELECT "life_events".* FROM "life_events" WHERE "life_events"."person_id" = $1  [["person_id", 2]]
---
<ul>
  <% @person.life_events.each do |life_event| %>