app/controllers/home_controller.rb

  def index
    @recent_events = LifeEvent.order("created_at DESC").limit(3)
    @recent_schools = School.order("created_at DESC").limit(3)
---
SELECT  "life_events".* FROM "life_events"  ORDER BY created_at DESC LIMIT 3
SELECT  "schools".* FROM "schools"  ORDER BY created_at DESC LIMIT 3