app/controllers/life_events_controller.rb

  def index
    @life_events = LifeEvent.all
---
SELECT "life_events".* FROM "life_events"

  def show
    @life_events = LifeEvent.find(params[:id])
---
SELECT  "life_events".* FROM "life_events" WHERE "life_events"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    @life_event = LifeEvent.new(life_event_params)

    respond_to do |format|
      if @life_event.save
---
INSERT INTO "life_events" ("title", "description", "date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "I am here"], ["description", "Here I am bro"], ["date", "2015-06-02"], ["created_at", "2015-06-02 01:54:36.502142"], ["updated_at", "2015-06-02 01:54:36.502142"]]

  def update
    respond_to do |format|
      if @life_event.update(life_event_params)
---
UPDATE "life_events" SET "person_id" = $1, "updated_at" = $2 WHERE "life_events"."id" = $3  [["person_id", 2], ["updated_at", "2015-06-04 19:43:26.867660"], ["id", 1]]

    def set_life_event
      @life_event = LifeEvent.find(params[:id])
---
SELECT  "life_events".* FROM "life_events" WHERE "life_events"."id" = $1 LIMIT 1  [["id", 1]]