app/controllers/people_controller.rb

SELECT "schools".* FROM "schools" WHERE "schools"."person_id" = $1  ORDER BY "schools"."start_year" ASC  [["person_id", 18]]
---
  def show
    @person = Person.find(params[:id])
    @schools = @person.schools.order(start_year: :desc)