app/controllers/schools_controller.rb

SELECT "schools".* FROM "schools"  ORDER BY "schools"."start_year" ASC
---
  def index
    @schools = School.all.order(:start_year)