app/controllers/schools_controller.rb

SELECT "schools".* FROM "schools"
---
  def index
    @schools = School.all

INSERT INTO "schools" ("name", "start_year", "end_year", "person_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "The Shire State College"], ["start_year", 970], ["end_year", 974], ["person_id", 1], ["created_at", "2015-06-04 19:51:22.716504"], ["updated_at", "2015-06-04 19:51:22.716504"]]
---
  def create
    @school = School.new(school_params)

    respond_to do |format|
      if @school.save

UPDATE "schools" SET "start_year" = $1, "end_year" = $2, "updated_at" = $3 WHERE "schools"."id" = $4  [["start_year", 1489], ["end_year", 1493], ["updated_at", "2015-06-04 20:11:44.766465"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @school.update(school_params)

DELETE FROM "schools" WHERE "schools"."id" = $1  [["id", 1]]
---
  def destroy
    @school.destroy

SELECT  "schools".* FROM "schools" WHERE "schools"."id" = $1 LIMIT 1  [["id", 1]]
---
    def set_school
      @school = School.find(params[:id])